; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation5 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	Star1 - direction
	Star4 - direction
	Star7 - direction
	Star3 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation9)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
)
(:goal (and
	(pointing satellite2 Planet10)
	(have_image Planet10 spectrograph1)
	(have_image Planet11 infrared0)
	(have_image Phenomenon12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Star14 infrared0)
	(have_image Star15 spectrograph1)
	(have_image Phenomenon16 infrared0)
))

)

; plan
1. (turn_to satellite2 star1 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star1)
   goals met: 0 of 8
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite2 star13 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star13)
   goals met: 0 of 8
5. (take_image satellite2 star13 instrument4 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite2 planet11 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 planet11)
   goals met: 1 of 8
7. (take_image satellite2 planet11 instrument4 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 2 of 8
8. (turn_to satellite2 phenomenon16 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon16)
   goals met: 2 of 8
9. (take_image satellite2 phenomenon16 instrument4 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 3 of 8
10. (turn_to satellite2 phenomenon12 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 8
11. (take_image satellite2 phenomenon12 instrument4 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 4 of 8
12. (turn_to satellite2 star14 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star14)
   goals met: 4 of 8
13. (take_image satellite2 star14 instrument4 infrared0)
   added: (have_image star14 infrared0)
   goals met: 5 of 8
14. (turn_to satellite2 star15 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star15)
   goals met: 5 of 8
15. (take_image satellite2 star15 instrument4 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 6 of 8
16. (turn_to satellite2 planet10 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 planet10)
   goals met: 7 of 8
17. (take_image satellite2 planet10 instrument4 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 8 of 8
